In [31]:
import seaborn as sns
import numpy as np
import pandas as pd

In [32]:
titanic = sns.load_dataset("titanic")

In [33]:
# prueba
tab1 = pd.crosstab(index = titanic['survived'],
                  columns = "pasajeros")
tab1

col_0     pasajeros
survived
0               549
1               342

# contigencia dos variables

In [34]:
survived_sex = pd.crosstab(index = titanic['survived'],
                          columns = titanic['sex'])
survived_sex

sex       female  male
survived
0             81   468
1            233   109

In [35]:
# podemos cambiar etiquetas de indice
survived_sex.index = ["died", 'survived']
survived_sex

sex       female  male
died          81   468
survived     233   109

In [36]:
# supervivencia por clases
survived_class = pd.crosstab(index = titanic['survived'],
                          columns = titanic['pclass'])
survived_class.index = ["murio", 'sobrevivio']
survived_class.columns = ["primera", 'segunda', 'tercera']
survived_class

            primera  segunda  tercera
murio            80       97      372
sobrevivio      136       87      119

In [37]:
# con margins, que son totales por fila y columna, hay que a√±adir titulos a columnas y filas de dichos totales

survived_class_r = pd.crosstab(index = titanic['survived'],
                          columns = titanic['pclass'],
                            margins = True)

survived_class_r.index = ["murio", 'sobrevivio', "total"]
survived_class_r.columns = ["primera", 'segunda', 'tercera', "total"]
survived_class_r

            primera  segunda  tercera  total
murio            80       97      372    549
sobrevivio      136       87      119    342
total           216      184      491    891

# frecuencias relativas

In [38]:
# globales , si hacemos la division con .sum() notemos que se agregara el total, lo que no  queremos. 
survived_class_r/survived_class_r.loc['total',"total"]

             primera   segunda   tercera     total
murio       0.089787  0.108866  0.417508  0.616162
sobrevivio  0.152637  0.097643  0.133558  0.383838
total       0.242424  0.206510  0.551066  1.000000

In [39]:
survived_class_r.loc['total',"total"]

np.int64(891)

In [61]:
survived_class_r.loc["total"]

primera    216
segunda    184
tercera    491
total      891
Name: total, dtype: int64

In [40]:
## relativas marginales columna
survived_class_r/survived_class_r.loc["total"]

            primera   segunda   tercera     total
murio       0.37037  0.527174  0.757637  0.616162
sobrevivio  0.62963  0.472826  0.242363  0.383838
total       1.00000  1.000000  1.000000  1.000000

In [41]:
# sin embargo para sacar marginal por renglon, no se puede, ya que python si divide filas entre filas, pero no columnas entre columnas
# una solucion es transponer
survived_class_r.T/survived_class_r.loc[:,"total"]

            murio  sobrevivio     total
primera  0.145719    0.397661  0.242424
segunda  0.176685    0.254386  0.206510
tercera  0.677596    0.347953  0.551066
total    1.000000    1.000000  1.000000

In [42]:
survived_class_r.loc[:,"total"]

murio         549
sobrevivio    342
total         891
Name: total, dtype: int64

In [43]:
# bien si no se quiere usar el .loc , directamente
survived_class_r.T/survived_class_r["total"]

            murio  sobrevivio     total
primera  0.145719    0.397661  0.242424
segunda  0.176685    0.254386  0.206510
tercera  0.677596    0.347953  0.551066
total    1.000000    1.000000  1.000000

In [44]:
# obien
survived_class_r.T/survived_class_r.total

            murio  sobrevivio     total
primera  0.145719    0.397661  0.242424
segunda  0.176685    0.254386  0.206510
tercera  0.677596    0.347953  0.551066
total    1.000000    1.000000  1.000000

In [45]:
#retornando funcion asu forma original

tr = survived_class_r.T/survived_class_r["total"]
tr.T

             primera   segunda   tercera  total
murio       0.145719  0.176685  0.677596    1.0
sobrevivio  0.397661  0.254386  0.347953    1.0
total       0.242424  0.206510  0.551066    1.0

In [46]:
# O bien directamente con corchetes y transponiendo dos veces
(survived_class_r.T/survived_class_r["total"]).T

             primera   segunda   tercera  total
murio       0.145719  0.176685  0.677596    1.0
sobrevivio  0.397661  0.254386  0.347953    1.0
total       0.242424  0.206510  0.551066    1.0

### otra solucion a las divisiones

In [47]:
# podemos usar funcion .div , recordar que axis = 0 es por filas, sera division por filas
survived_class_r.div(survived_class_r["total"] , axis = 0)

             primera   segunda   tercera  total
murio       0.145719  0.176685  0.677596    1.0
sobrevivio  0.397661  0.254386  0.347953    1.0
total       0.242424  0.206510  0.551066    1.0

In [48]:
# igual por columnas
survived_class_r.div(survived_class_r.loc["total"] , axis = 1)

            primera   segunda   tercera     total
murio       0.37037  0.527174  0.757637  0.616162
sobrevivio  0.62963  0.472826  0.242363  0.383838
total       1.00000  1.000000  1.000000  1.000000

## dimensiones superiores

In [49]:
# se ponen listas en index o columns
surv_class_sex = pd.crosstab(index = titanic['survived'],
                          columns = [titanic['pclass'],titanic['sex']],
                            margins = True)
surv_class_sex

pclass        1           2           3       All
sex      female male female male female male
survived
0             3   77      6   91     72  300  549
1            91   45     70   17     72   47  342
All          94  122     76  108    144  347  891

In [50]:
# oreden importa naturalmente
surv_class_sex = pd.crosstab(index = titanic['survived'],
                          columns = [titanic['sex'],titanic['pclass']],
                            margins = True)
surv_class_sex

sex      female          male            All
pclass        1   2    3    1    2    3
survived
0             3   6   72   77   91  300  549
1            91  70   72   45   17   47  342
All          94  76  144  122  108  347  891

In [51]:
surv_class_sex = pd.crosstab(index = [titanic['sex'],titanic['pclass']],
                          columns = titanic['survived'],
                            margins = True)
surv_class_sex

survived         0    1  All
sex    pclass
female 1         3   91   94
       2         6   70   76
       3        72   72  144
male   1        77   45  122
       2        91   17  108
       3       300   47  347
All            549  342  891

In [52]:
# para acceder se hacer por columanas directo considerando la jerarquia, que difiere un poco de R
surv_class_sex[0]

sex     pclass
female  1           3
        2           6
        3          72
male    1          77
        2          91
        3         300
All               549
Name: 0, dtype: int64

In [53]:
# en el caso de por filas, estan "anidadas" y es mejor hacerlo con .loc para dar nombre de level de la fila
surv_class_sex.loc['female']

survived   0   1  All
pclass
1          3  91   94
2          6  70   76
3         72  72  144

In [54]:
# accedemos a pclass, notemos que se accede con entero, si s epone "1" como string da error
surv_class_sex.loc['female'].loc[1]

survived
0       3
1      91
All    94
Name: 1, dtype: int64

In [55]:
# de lo contrario sucede esto que filtra demasiado, quitando incluso la siguiente categoria, ayq eu solo va al primer renglon
surv_class_sex.iloc[0]

survived
0       3
1      91
All    94
Name: (female, 1), dtype: int64

In [56]:
# si esta anidada por columnas

surv_class_sex = pd.crosstab(index = titanic['survived'],
                          columns = [titanic['pclass'],titanic['sex']],
                            margins = True)
surv_class_sex

pclass        1           2           3       All
sex      female male female male female male
survived
0             3   77      6   91     72  300  549
1            91   45     70   17     72   47  342
All          94  122     76  108    144  347  891

In [57]:
# entonces debemos acceder por columnas
surv_class_sex[1]

sex       female  male
survived
0              3    77
1             91    45
All           94   122

In [58]:
surv_class_sex[1]["female"]

survived
0       3
1      91
All    94
Name: female, dtype: int64

In [59]:
# marginal por filas
surv_class_sex/surv_class_sex.loc["All"]

pclass           1                   2                3                 All
sex         female      male    female      male female      male
survived
0         0.031915  0.631148  0.078947  0.842593    0.5  0.864553  0.616162
1         0.968085  0.368852  0.921053  0.157407    0.5  0.135447  0.383838
All       1.000000  1.000000  1.000000  1.000000    1.0  1.000000  1.000000

In [60]:
# marginal por columnas
(surv_class_sex.T/surv_class_sex["All"]).T

pclass           1                   2                   3            All
sex         female      male    female      male    female      male
survived
0         0.005464  0.140255  0.010929  0.165756  0.131148  0.546448  1.0
1         0.266082  0.131579  0.204678  0.049708  0.210526  0.137427  1.0
All       0.105499  0.136925  0.085297  0.121212  0.161616  0.389450  1.0